Repository: axel-paillaud/dialog-prestashop
Catalog: translations/*/ModulesAskdialogAdmin.*.xlf
Languages: es_es, fr_fr

source: Module to provide the AskDialog assistant on your e-shop
es_es: Módulo para dotar del asistente AskDialog a tu tienda online
fr_fr: Module pour mettre à disposition l'assistant AskDialog sur votre e-shop

source: Your Expert
es_es: Su experto

source: A question about this product?
es_es: ¿Alguna pregunta sobre este producto?

source: How can I help you with this product?
es_es: ¿Cómo puedo ayudarte con este producto?
fr_fr: Comment puis-je vous aider avec ce produit ?

source: Primary Color
es_es: Color primario
fr_fr: Couleur primaire

source: Main color for buttons and accents (hex format: #RRGGBB)
es_es: Color principal para botones y acentos (formato hexadecimal: #RRGGBB)
fr_fr: Couleur principale des boutons et des accents (format hexa : #RRGGBB)

source: Please enter a valid hex color (e.g., #CCCCCC)
es_es: Ingrese un color hexadecimal válido (por ejemplo, #CCCCCC)
fr_fr: Veuillez entrer une couleur hexadécimale valide (par exemple, #CCCCCC)

source: Background Color
es_es: Color de fondo
fr_fr: Couleur d'arrière-plan

source: Background color for the dialog widget (hex format: #RRGGBB)
es_es: Color de fondo para el widget de diálogo (formato hexadecimal: #RRGGBB)
fr_fr: Couleur d'arrière-plan du widget de dialogue (format hexadécimal : #RRGGBB)

source: Please enter a valid hex color (e.g., #FFFFFF)
es_es: Ingrese un color hexadecimal válido (por ejemplo, #FFFFFF)
fr_fr: Veuillez entrer une couleur hexadécimale valide (par exemple, #FFFFFF)

source: CTA Text Color
es_es: Color del texto de la CTA
fr_fr: Couleur du texte CTA

source: Text color for call-to-action buttons (hex format: #RRGGBB)
es_es: Color del texto para los botones de llamada a la acción (formato hexadecimal: #RRGGBB)
fr_fr: Couleur du texte pour les boutons d'appel à l'action (format hexadécimal : #RRGGBB)

source: Please enter a valid hex color (e.g., #000000)
es_es: Ingrese un color hexadecimal válido (por ejemplo, #000000)
fr_fr: Veuillez entrer une couleur hexadécimale valide (par exemple, #000000)

source: CTA Border Type
es_es: Tipo de borde de CTA
fr_fr: Type de bordure CTA

source: Border style for call-to-action buttons
es_es: Estilo de borde para botones de llamada a la acción
fr_fr: Style de bordure pour les boutons d'appel à l'action

source: Capitalize CTAs
es_es: Capitalizar las llamadas a la acción

source: Automatically capitalize call-to-action button text
es_es: Capitalizar automáticamente el texto del botón de llamada a la acción
fr_fr: Mettre automatiquement en majuscule le texte du bouton d'appel à l'action

source: Font Family
es_es: Familia de fuentes

source: CSS font family for the dialog widget (e.g., Arial, sans-serif)
es_es: Familia de fuentes CSS para el widget de diálogo (por ejemplo, Arial, sans-serif)
fr_fr: Famille de polices CSS pour le widget de dialogue (par exemple, Arial, sans-serif)

source: Font family cannot be longer than {{ limit }} characters
es_es: La familia de fuentes no puede tener más de {{ limit }} caracteres
fr_fr: La famille de polices ne peut pas comporter plus de {{ limit }} caractères

source: Highlight Product Name
es_es: Resaltar el nombre del producto
fr_fr: Mettre en surbrillance le nom du produit

source: API Key public
es_es: Clave API pública
fr_fr: Clé API publique

source: Public API key provided by AskDialog
es_es: Clave API pública proporcionada por AskDialog
fr_fr: Clé API publique fournie par AskDialog

source: Public API key is required
es_es: Se requiere una clave API pública
fr_fr: Une clé API publique est requise

source: API key must be at least {{ limit }} characters long
es_es: La clave API debe tener al menos {{ limit }} caracteres
fr_fr: La clé API doit comporter au moins {{ limit }} caractères

source: API key cannot be longer than {{ limit }} characters
es_es: La clave API no puede tener más de {{ limit }} caracteres
fr_fr: La clé API ne peut pas comporter plus de {{ limit }} caractères

source: API Key private
es_es: Clave API privada
fr_fr: Clé API privée

source: Private API key provided by AskDialog
es_es: Clave API privada proporcionada por AskDialog
fr_fr: Clé API privée fournie par AskDialog

source: Private API key is required
es_es: Se requiere una clave API privada
fr_fr: Une clé API privée est requise

source: Enable on Product Page
es_es: Habilitar en la página del producto
fr_fr: Activer sur la page produit

source: Enable or disable the AskDialog assistant on the product page
es_es: Habilitar o deshabilitar el asistente AskDialog en la página del producto
fr_fr: Activer ou désactiver l'assistant AskDialog sur la page produit

source: Export Batch Size
es_es: Tamaño del lote de exportación

source: Number of products to process per batch during catalog export. Lower values reduce memory usage and timeout risk on large catalogs. Default: 5000
es_es: Número de productos a procesar por lote durante la exportación del catálogo. Valores bajos reducen el uso de memoria y el riesgo de tiempo de espera en catálogos grandes. Valor predeterminado: 5000

source: Batch size must be between {{ min }} and {{ max }}
es_es: El tamaño del lote debe estar entre {{ min }} y {{ max }}

source: Configuration
es_es: Configuración

source: Appearance
es_es: Apariencia
fr_fr: Apparence

source: API Configuration
es_es: Configuración de API
fr_fr: Configuration des API

source: Don't have API keys yet?
es_es: ¿Aún no tienes claves API?
fr_fr: Vous n'avez pas encore de clés API ?

source: Go to AskDialog onboarding
es_es: Vaya a la incorporación de AskDialog
fr_fr: Accédez à l'intégration d'AskDialog

source: Widget Appearance
es_es: Apariencia del widget
fr_fr: Apparence des widgets

source: Customize the appearance of the Dialog widget. Leave fields empty to use default values or allow theme overrides.
es_es: Personaliza la apariencia del widget Diálogo. Deja los campos vacíos para usar los valores predeterminados o permitir la anulación de temas.
fr_fr: Personnalisez l'apparence du widget Boîte de dialogue. Laissez les champs vides pour utiliser les valeurs par défaut ou autoriser les remplacements de thème.

source: AskDialog Assistant
fr_fr: Assistant AskDialog

source: Highlight the product name in the dialog responses
fr_fr: Mettez en surbrillance le nom du produit dans les réponses de la boîte de dialogue
